---
type: DockableFrameFocusChangedEventArgs
namespace: Autodesk.Revit.UI.Events
version: 2024
members: 2
tags: [revit-api, class]
---

# DockableFrameFocusChangedEventArgs

`Autodesk.Revit.UI.Events.DockableFrameFocusChangedEventArgs` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | FocusGained | 2015 | `public bool FocusGained { get ; }` |
| Property | PaneId | 2015 | `public DockablePaneId PaneId { get ; }` |